package Server 
{
	import adobe.utils.CustomActions;
	import artur.win.WinArena;
	import report.Report;
	public class Lang 
	{
		public static var lang:int = 0;
		private static var lang_table:Array = new Array();
		
		public static function init():void
		{
			Lang.lang_table[0] = new Array();
			lang_table[0][0] = ["Начало пути", "", "", ""];
			lang_table[0][1] = ["Зеленая тропа", "", "", ""];
			lang_table[0][2] = ["В поисках истины", "", "", ""];
			lang_table[0][3] = ["Туман войны", "", "", ""];
			lang_table[0][4] = ["Поворот не туда", "", "", ""];
			lang_table[0][5] = ["Проклятая река", "", "", ""];
			lang_table[0][6] = ["Верная стража", "", "", ""];
			lang_table[0][7] = ["Звон монет", "", "", ""];
			lang_table[0][8] = ["Шепото дракона", "", "", ""];
			lang_table[0][9] = ["Клыкастая месть", "", "", ""];
			lang_table[0][10] = ["БОСС", "", "", ""];
			lang_table[0][11] = ["Земля проклятых", "", "", ""];
			lang_table[0][12] = ["Шелест листьев", "", "", ""];
			lang_table[0][13] = ["Две башни", "", "", ""];
			lang_table[0][14] = ["Лесные шелесты", "", "", ""];
			lang_table[0][15] = ["Вулканическая пыль", "", "", ""];
			lang_table[0][16] = ["Крик орков", "", "", ""];
			lang_table[0][17] = ["Лужайка единорогов", "", "", ""];
			lang_table[0][18] = ["Сердце кошмара", "", "", ""];
			lang_table[0][19] = ["Кровавый прибой", "", "", ""];
			lang_table[0][20] = ["Прах и ярость", "", "", ""];
			lang_table[0][21] = ["БОСС", "", "", ""];
			Lang.lang_table[1] = new Array();
			Lang.lang_table[1][0] = ["Шлем", "", ""];
			Lang.lang_table[1][1] = ["Кольчуга", "", ""];
			Lang.lang_table[1][2] = ["Сапоги", "", ""];
			Lang.lang_table[1][3] = ["Наплечники", "", ""];
			Lang.lang_table[1][4] = ["Перчатки", "", ""];
			Lang.lang_table[1][5] = ["Оружие", "", ""];
			Lang.lang_table[1][6] = ["Щиты", "", ""];
			Lang.lang_table[1][7] = ["Инвентарь", "", ""];
			Lang.lang_table[2] = ["У одного из вашых\n воинов повысился уровень,\n зайдите  в замок,\n чтобы улучшить его.", "", "" ];
			Lang.lang_table[3] = [["Банк", "", ""], ["Топ", "", ""], ["Замок", "", ""], ["Арена", "", ""], ['Кузница', "", ""], ["Карта", "", ""]];
			Lang.lang_table[4] = ["У вас недостаточно\n ресурсов для этой\n покупки. Вы можете купить ресурсы в банке или же заработать в миссиях.", "", ""];
			Lang.lang_table[5] = ["Критический урон", "", ""];
			Lang.lang_table[6] = ["Уворот", "", ""];
			Lang.lang_table[7] = ["Двойная атака", "", ""];
			Lang.lang_table[8] = ["Бешенсво", "", ""];
			Lang.lang_table[9] = ["Ответный удар", "", ""];
			Lang.lang_table[10] = ["шанс нанести двойной урон</font>\n Следующий уровень", "", ""];
			Lang.lang_table[11] = ["шанс уклониться от удара</font>\n Следующий уровень", "", ""];
			Lang.lang_table[12] = ["шанс атаковать два раза</font>\n Следующий уровень", "", ""];
			Lang.lang_table[13] = ["шанс атаковать сквозь защиту</font>\n Следующий уровень", "", ""];
			Lang.lang_table[14] = ["шанс нанести ответный удар</font>\n Следующий уровень", "", ""];
			Lang.lang_table[15] = ["Ярость", "", ""];
			Lang.lang_table[16] = ["Лечение", "", ""];
			Lang.lang_table[17] = ["Огненная стрела", "", ""];
			Lang.lang_table[18] = ["Молния", "", ""];
			Lang.lang_table[19] = [" увеличивает урон юнита на ", "", ""];
			Lang.lang_table[20] = ["на текущий ход", "", ""];
			Lang.lang_table[21] = [" востанавливает ", "", ""];
			Lang.lang_table[22] = [" единиц здоровья любому союзному юниту", "", ""];
			Lang.lang_table[23] = [" Оглушает вражеского юнита огненной стрелой и наносит ", "", ""];
			Lang.lang_table[24] = [" урона", "", ""];
			Lang.lang_table[25] = [" Поражает вражеского юнита молнией при этом наносит ему ", "", ""];
			Lang.lang_table[26] = ["Следующий уровень - ", "", ""];
			Lang.lang_table[27] = [" единиц", "", ""];
			Lang.lang_table[28] = ["Стоимость заклинания ", "", ""];
			Lang.lang_table[29] = [" манны", "", ""];
			Lang.lang_table[30] = ["Нажмите что бы улучшить!", "", ""];
			Lang.lang_table[31] = ["Навык", "", ""];
			Lang.lang_table[32] = ["Я хочу продать", "", ""];
			Lang.lang_table[33] = ["Нажмите, что бы купить вещь", "", ""];
			Lang.lang_table[34] = [" Убил: ", "", ""];
			Lang.lang_table[35] = [" Умер: ", "", ""];
			Lang.lang_table[36] = ["Вы не сможете победить! Наймите воина. Если у вас уже есть воин - купите ему оружие.", "", ""];
			Lang.lang_table[37] = ["Миссия еще не доступна, ожидайте ее в скором времени!!", "", ""];
			Lang.lang_table[38] = [["Варвар", "", ""], ["Омник", "", ""], ["Лучник", "", ""], ["Маг", "", ""]];
			Lang.lang_table[39] = ["Я хочу нанять", "", ""];
			Lang.lang_table[40] = [["Новичек","",""], ["Воин","","",],["Стратег","",""],["Царь","",""]];
			Lang.lang_table[41] = ["Что бы улучшить, надо вещь и как минимум один каминь.", "", ""];
			Lang.lang_table[42] = ["У Вас недостаточно золота для улучшения. Вы можете купить золото в банке или заработать в миссиях.", "", ""];
			Lang.lang_table[43] = new Array();
			Lang.lang_table[43][0] = ["Рубин ур.1", "", ""];
			Lang.lang_table[43][1] = ["Изумруд ур.1", "", ""];
			Lang.lang_table[43][2] = ["Аметист ур.1", "", ""];
			Lang.lang_table[43][3] = ["Сапфир ур.1", "", ""];
			Lang.lang_table[43][4] = ["Топаз ур.1", "", ""];
			
			Lang.lang_table[43][5] = ["Рубин ур.2", "", ""];
			Lang.lang_table[43][6] = ["Изумруд ур.2", "", ""];
			Lang.lang_table[43][7] = ["Аметист ур.2", "", ""];
			Lang.lang_table[43][8] = ["Сапфир ур.2", "", ""];
			Lang.lang_table[43][9] = ["Топаз ур.2", "", ""];
			
			Lang.lang_table[43][10] = ["Рубин ур.3", "", ""];
			Lang.lang_table[43][11] = ["Изумруд ур.3", "", ""];
			Lang.lang_table[43][12] = ["Аметист ур.3", "", ""];
			Lang.lang_table[43][13] = ["Сапфир ур.3", "", ""];
			Lang.lang_table[43][14] = ["Топаз ур.3", "", ""];
			
			Lang.lang_table[44] = ["Что бы участвовать в поединкe нужен уровень " + WinArena.NEEDED_LVL + ". Получить его можно проходя миссии.", "", ""];
			Lang.lang_table[45] = ["У Вас недостаточно золота для этой покупки. Вы можете купить золото в банке или заработать в миссиях.", "", ""];
			Lang.lang_table[46] = ["У Вас недостаточно серебра для этой покупки. Вы можете купить серебро в банке или заработать в миссиях.", "", ""];
			Lang.lang_table[47] = ["Закрыть", "", ""];
			Lang.lang_table[48] = ["Купить за золото", "", ""];
			Lang.lang_table[49] = ["Купить за серебро", "", ""];
			Lang.lang_table[50] = ["Продать за серебро", "", ""];
			Lang.lang_table[51] = ["Искать игру", "", ""];
			Lang.lang_table[52] = ["Заказать каминь", "", ""];
			Lang.lang_table[53] = ["Улучшить вещь", "", ""];
			Lang.lang_table[54] = ["Добавить в сундук", "", ""];
			//Lang.lang_table[55] = [" в сундук", "", ""];
			//Lang.lang_table[56] = ["Забрать ", "", ""];
			Lang.lang_table[57] = ["Забрать из сундука", "", ""];
			
			Lang.lang_table[58] = new Array();
			Lang.lang_table[58][0] = ["Добавит +1 к здоровью", "", ""];
			Lang.lang_table[58][1] = ["Добавит +1 к манне", "", ""];
			Lang.lang_table[58][2] = ["Добавит +1 к урону", "", ""];
			Lang.lang_table[58][3] = ["Добавит +1 к физ. защите", "", ""];
			Lang.lang_table[58][4] = ["Добавит +1 к маг. защите", "", ""];
			
			Lang.lang_table[58][5] = ["Добавит +2 к здоровью", "", ""];
			Lang.lang_table[58][6] = ["Добавит +2 к манне", "", ""];
			Lang.lang_table[58][7] = ["Добавит +2 к урону", "", ""];
			Lang.lang_table[58][8] = ["Добавит +2 к физ. защите", "", ""];
			Lang.lang_table[58][9] = ["Добавит +2 к маг. защите", "", ""];
			
			Lang.lang_table[58][10] = ["Добавит +3 к здоровью", "", ""];
			Lang.lang_table[58][11] = ["Добавит +3 к манне", "", ""];
			Lang.lang_table[58][12] = ["Добавит +3 к урону", "", ""];
			Lang.lang_table[58][13] = ["Добавит +3 к физ. защите", "", ""];
			Lang.lang_table[58][14] = ["Добавит +3 к маг. защите", "", ""];
			
			Lang.lang_table[59] = new Array();
			Lang.lang_table[59][0] = ["10 камней добавят +1 к здоровью ", "", ""];
			Lang.lang_table[59][1] = ["10 камней добавят +1 к манне", "", ""];
			Lang.lang_table[59][2] = ["10 камней добавят +1 к урону", "", ""];
			Lang.lang_table[59][3] = ["10 камней добавят +1 к физ. защите", "", ""];
			Lang.lang_table[59][4] = ["10 камней добавят +1 к маг. защите", "", ""];
			
			Lang.lang_table[59][5] = ["10 камней добавят +2 к здоровью", "", ""];
			Lang.lang_table[59][6] = ["10 камней добавят +2 к манне", "", ""];
			Lang.lang_table[59][7] = ["10 камней добавят +2 к урону", "", ""];
			Lang.lang_table[59][8] = ["10 камней добавят +2 к физ. защите", "", ""];
			Lang.lang_table[59][9] = ["10 камней добавят +2 к маг. защите", "", ""];
			
			Lang.lang_table[59][10] = ["10 камней добавят +3 к здоровью", "", ""];
			Lang.lang_table[59][11] = ["10 камней добавят +3 к манне", "", ""];
			Lang.lang_table[59][12] = ["10 камней добавят +3 к урону", "", ""];
			Lang.lang_table[59][13] = ["10 камней добавят +3 к физ. защите", "", ""];
			Lang.lang_table[59][14] = ["10 камней добавят +3 к маг. защите", "", ""];
			
			
			
			
			
			
			
			
			
			
		}
		
		public function Lang()
		{
			
		}
		
		public static function getTitle(id1:int, id2:int = -1, id3:int = -1):String
		{
			if (id3 > -1)
			{
				if (Lang.lang_table[id1] != null && Lang.lang_table[id1][id2] != null && Lang.lang_table[id1][id2][id3] != null && Lang.lang_table[id1][id2][id3][Lang.lang] != null)
					return Lang.lang_table[id1][id2][id3][Lang.lang];
				else
					return "";
			}
			else if (id2 > -1)
			{
				if (Lang.lang_table[id1] != null && Lang.lang_table[id1][id2] != null && Lang.lang_table[id1][id2][Lang.lang] != null)
					return Lang.lang_table[id1][id2][Lang.lang];
				else
					return "";
			}
			else
			{
				if (Lang.lang_table[id1] != null && Lang.lang_table[id1][Lang.lang] != null)
					return Lang.lang_table[id1][Lang.lang];
				else
					return "";
			}
		}
	}
}